[
    {
      "bookId": 1,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/0jpr7kk/1.jpg",
      "review": "To Kill a Mockingbird is a timeless classic that explores the complexities of human nature, morality, and justice through the innocent eyes of Scout Finch. Set in the racially charged atmosphere of 1930s Alabama, the novel follows Scout's father, Atticus Finch, a lawyer who defends a black man falsely accused of raping a white woman. Through vivid storytelling and poignant characters, Harper Lee confronts themes of prejudice, empathy, and the loss of innocence, leaving a lasting impact on readers. The book's powerful message of compassion and integrity resonates as strongly today as it did upon its publication.",
      "totalPages": 281,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Classic", "Legal Drama", "Social Issues"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 2,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/Y23mPr3/2.jpg",
      "review": "In George Orwell's dystopian masterpiece, 1984, he paints a chilling picture of a totalitarian regime where individuality is suppressed, truth is manipulated, and freedom is a distant memory. Set in a world constantly surveilled by Big Brother, the novel follows Winston Smith, a disillusioned party member who dares to rebel against the oppressive government. Through its portrayal of surveillance, propaganda, and thought control, 1984 serves as a stark warning about the dangers of authoritarianism and the erosion of personal freedoms. Orwell's grim vision of a future dominated by oppression remains disturbingly relevant in today's world.",
      "totalPages": 328,
      "rating": 4.7,
      "category": "Science Fiction",
      "tags": ["Dystopian", "Political Allegory", "Totalitarianism"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 3,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/MRWmGvW/3.jpg",
      "review": "F. Scott Fitzgerald's The Great Gatsby is a mesmerizing portrayal of the Jazz Age, exploring the decadence, disillusionment, and elusive pursuit of the American Dream. Set amidst the opulence of Long Island's elite, the novel follows the enigmatic Jay Gatsby and his obsession with the beautiful but unattainable Daisy Buchanan. Through its vivid prose and compelling characters, Fitzgerald captures the essence of an era marked by excess and moral ambiguity. The Great Gatsby remains a timeless classic that delves into themes of love, longing, and the fragility of human aspirations.",
      "totalPages": 180,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["Romance", "Social Critique", "Roaring Twenties"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
      "bookId": 4,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/kJZLt9B/4.jpg",
      "review": "Jane Austen's Pride and Prejudice is a timeless masterpiece that continues to captivate readers with its wit, romance, and social commentary. Set in early 19th-century England, the novel follows the spirited Elizabeth Bennet as she navigates the complexities of love, marriage, and societal expectations. Through Austen's sharp observations and sparkling dialogue, Pride and Prejudice explores themes of class, gender, and the pursuit of happiness. With its memorable characters and enduring charm, the novel remains a beloved classic that transcends time.",
      "totalPages": 279,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Romance", "Social Satire", "Regency Era"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "bookId": 5,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/Jxc6pBC/5.jpg",
      "review": "J.D. Salinger's The Catcher in the Rye is a poignant coming-of-age novel that continues to resonate with readers of all generations. Narrated by the disillusioned teenager Holden Caulfield, the novel follows his journey of self-discovery and rebellion against the phoniness of the adult world. Through its raw honesty and rebellious spirit, The Catcher in the Rye captures the essence of adolescent angst and the search for authenticity. Salinger's timeless classic remains as relevant today as it was upon its publication, offering a powerful exploration of identity, alienation, and the loss of innocence.",
      "totalPages": 224,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Coming-of-Age", "Alienation", "American Literature"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": 6,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/cvchRCr/6.jpg",
      "review": "J.R.R. Tolkien's The Hobbit is a timeless adventure that transports readers to the enchanting world of Middle-earth. The story follows the humble hobbit Bilbo Baggins as he embarks on a perilous journey to reclaim the lost kingdom of Erebor from the fearsome dragon Smaug. Along the way, Bilbo encounters trolls, goblins, and elves, forming unexpected friendships and discovering courage he never knew he possessed. With its rich mythology, captivating characters, and epic quest, The Hobbit is a beloved classic that continues to inspire readers of all ages.",
      "totalPages": 310,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["Adventure", "Quest", "Middle-earth"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
    },
    {
        "bookId": 7,
        "bookName": "Harry Potter and the Sorcerer's Stone",
        "author": "J.K. Rowling",
        "image": "https://i.ibb.co/J72v9Ss/7.jpg",
        "review": "J.K. Rowling's Harry Potter and the Sorcerer's Stone is a magical tale of friendship, bravery, and the power of imagination. The story follows young Harry Potter as he discovers his true identity as a wizard and begins his education at Hogwarts School of Witchcraft and Wizardry. Alongside his loyal friends Ron and Hermione, Harry navigates the challenges of school life while uncovering the mysteries surrounding his past and the dark forces that threaten the wizarding world. Rowling's enchanting narrative transports readers to a world filled with spells, potions, and mythical creatures, captivating both children and adults alike. With its themes of love, loyalty, and the triumph of good over evil, Harry Potter and the Sorcerer's Stone marks the beginning of an extraordinary journey that has captured the hearts of millions worldwide.",
        "totalPages": 309,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Magic", "Friendship", "Wizards"],
        "publisher": "Bloomsbury Publishing",
        "yearOfPublishing": 1997
    },
    {
      "bookId": 8,
      "bookName": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/4S9zgpx/8.jpg",
      "review": "J.R.R. Tolkien's The Lord of the Rings is an epic fantasy masterpiece that transports readers to the enchanting realm of Middle-earth. The story unfolds across three volumes—The Fellowship of the Ring, The Two Towers, and The Return of the King—and follows the perilous quest to destroy the One Ring and defeat the dark lord Sauron. With its richly imagined world, complex characters, and epic battles between good and evil, The Lord of the Rings captivates readers with its timeless tale of heroism, sacrifice, and the enduring power of friendship.",
      "totalPages": 1178,
      "rating": 4.9,
      "category": "Fantasy",
      "tags": ["Epic", "Adventure", "Middle-earth"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1954
    },
    {
      "bookId": 9,
      "bookName": "The Hunger Games",
      "author": "Suzanne Collins",
      "image": "https://i.ibb.co/n8QSQQK/9.jpg",
      "review": "Suzanne Collins' The Hunger Games is a gripping dystopian novel that immerses readers in a world of survival, sacrifice, and rebellion. Set in the ruins of a future North America, the story follows Katniss Everdeen, a courageous young woman who volunteers to participate in the brutal Hunger Games—a televised fight to the death orchestrated by the oppressive Capitol. As Katniss navigates the deadly arena and forms alliances with fellow tributes, she becomes a symbol of hope for the downtrodden districts, sparking a revolution against tyranny. With its thrilling action, complex characters, and thought-provoking themes, The Hunger Games is a riveting read that leaves a lasting impression.",
      "totalPages": 374,
      "rating": 4.7,
      "category": "Science Fiction",
      "tags": ["Dystopian", "Survival", "Revolution"],
      "publisher": "Scholastic Press",
      "yearOfPublishing": 2008
    },
    {
      "bookId": 10,
      "bookName": "The Da Vinci Code",
      "author": "Dan Brown",
      "image": "https://i.ibb.co/gPDn4Jq/10.jpg",
      "review": "Dan Brown's The Da Vinci Code is a thrilling mystery that takes readers on a journey through art, history, and conspiracy. The story follows symbologist Robert Langdon and cryptologist Sophie Neveu as they unravel a series of cryptic clues left by a murdered curator, leading them on a quest to uncover the truth about the Holy Grail and the secrets of the Catholic Church. With its fast-paced plot, intricate puzzles, and shocking revelations, The Da Vinci Code keeps readers on the edge of their seats until the very end. Brown's gripping narrative blurs the line between fact and fiction, creating a captivating reading experience that lingers long after the final page.",
      "totalPages": 454,
      "rating": 4.5,
      "category": "Mystery",
      "tags": ["Conspiracy", "Religious Symbols", "Thriller"],
      "publisher": "Doubleday",
      "yearOfPublishing": 2003
    },
    {
      "bookId": 11,
      "bookName": "The Alchemist",
      "author": "Paulo Coelho",
      "image": "https://i.ibb.co/PgJLzXT/11.jpg",
      "review": "Paulo Coelho's The Alchemist is a philosophical novel that inspires readers to pursue their dreams and listen to the voice of their hearts. The story follows Santiago, a young Andalusian shepherd who embarks on a transformative journey in search of a hidden treasure. Along the way, Santiago encounters wise mentors, tests his courage, and learns profound lessons about the interconnectedness of the universe. Through its allegorical storytelling and spiritual wisdom, The Alchemist encourages readers to embrace the unknown, follow their passions, and discover their true destinies. Coelho's timeless fable resonates with readers of all ages, reminding them that the greatest treasure lies within.",
      "totalPages": 197,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Philosophical", "Quest", "Inspiration"],
      "publisher": "HarperCollins",
      "yearOfPublishing": 1988
    },
    {
      "bookId": 12,
      "bookName": "The Fault in Our Stars",
      "author": "John Green",
      "image": "https://i.ibb.co/QjKfFGD/12.jpg",
      "review": "John Green's The Fault in Our Stars is a heartrending novel that explores love, loss, and the fragility of life. The story follows Hazel Grace Lancaster, a sixteen-year-old cancer patient who meets and falls in love with Augustus Waters, a charming and witty fellow survivor at a support group. Together, they embark on a journey to Amsterdam to meet their favorite author, confronting their fears and embracing the beauty of the present moment. Through its authentic characters and poignant prose, The Fault in Our Stars celebrates the power of human connection and the resilience of the human spirit. Green's poignant narrative reminds readers that even in the face of adversity, love remains a force that transcends time and space.",
      "totalPages": 313,
      "rating": 4.8,
      "category": "Young Adult",
      "tags": ["Romance", "Cancer", "Friendship"],
      "publisher": "Dutton Books",
      "yearOfPublishing": 2012
    }
  ]
    